//Напишите программу, которая находит количество цифр в заданном числе.

#include <iostream>

using namespace std;

int main()
{
    setlocale(0, "");
    int num, elem;
    cout<<"введите число: ";
    cin>>num;
    while(num>0){
        num=num/10;
        elem+=1;
    }
    cout<<"количество цифр "<<elem<<endl;
    return 0;
}
